analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32672/Include/adc_regs.h
/**
 * @file    adc_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the ADC Peripheral Module.
 * @note    This file is @generated.
 * @ingroup adc_registers
 */

/******************************************************************************
 *
 * Copyright (C) 2022-2023 Maxim Integrated Products, Inc. (now owned by 
 * Analog Devices, Inc.),
 * Copyright (C) 2023-2026 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32672_INCLUDE_ADC_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32672_INCLUDE_ADC_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#ifdef __cplusplus
#define __I volatile
#else
#define __I volatile const
#endif
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     adc
 * @defgroup    adc_registers ADC_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the ADC Peripheral Module.
 * @details     Inter-Integrated Circuit.
 */

/**
 * @ingroup adc_registers
 * Structure type to access the ADC Registers.
 */
typedef struct {
    __IO uint32_t ctrl0;                /**< <tt>\b 0x00:</tt> ADC CTRL0 Register */
    __IO uint32_t ctrl1;                /**< <tt>\b 0x04:</tt> ADC CTRL1 Register */
    __IO uint32_t clkctrl;              /**< <tt>\b 0x08:</tt> ADC CLKCTRL Register */
    __IO uint32_t sampclkctrl;          /**< <tt>\b 0x0C:</tt> ADC SAMPCLKCTRL Register */
    __IO uint32_t chsel0;               /**< <tt>\b 0x10:</tt> ADC CHSEL0 Register */
    __IO uint32_t chsel1;               /**< <tt>\b 0x14:</tt> ADC CHSEL1 Register */
    __IO uint32_t chsel2;               /**< <tt>\b 0x18:</tt> ADC CHSEL2 Register */
    __IO uint32_t chsel3;               /**< <tt>\b 0x1C:</tt> ADC CHSEL3 Register */
    __R  uint32_t rsv_0x20_0x2f[4];
    __IO uint32_t restart;              /**< <tt>\b 0x30:</tt> ADC RESTART Register */
    __R  uint32_t rsv_0x34_0x3b[2];
    __IO uint32_t datafmt;              /**< <tt>\b 0x3C:</tt> ADC DATAFMT Register */
    __IO uint32_t fifodmactrl;          /**< <tt>\b 0x40:</tt> ADC FIFODMACTRL Register */
    __IO uint32_t data;                 /**< <tt>\b 0x44:</tt> ADC DATA Register */
    __IO uint32_t status;               /**< <tt>\b 0x48:</tt> ADC STATUS Register */
    __IO uint32_t chstatus;             /**< <tt>\b 0x4C:</tt> ADC CHSTATUS Register */
    __IO uint32_t inten;                /**< <tt>\b 0x50:</tt> ADC INTEN Register */
    __IO uint32_t intfl;                /**< <tt>\b 0x54:</tt> ADC INTFL Register */
    __R  uint32_t rsv_0x58_0x5f[2];
    __IO uint32_t sfraddroffset;        /**< <tt>\b 0x60:</tt> ADC SFRADDROFFSET Register */
    __IO uint32_t sfraddr;              /**< <tt>\b 0x64:</tt> ADC SFRADDR Register */
    __IO uint32_t sfrwrdata;            /**< <tt>\b 0x68:</tt> ADC SFRWRDATA Register */
    __IO uint32_t sfrrddata;            /**< <tt>\b 0x6C:</tt> ADC SFRRDDATA Register */
    __IO uint32_t sfrstatus;            /**< <tt>\b 0x70:</tt> ADC SFRSTATUS Register */
} mxc_adc_regs_t;

/* Register offsets for module ADC */
/**
 * @ingroup    adc_registers
 * @defgroup   ADC_Register_Offsets Register Offsets
 * @brief      ADC Peripheral Register Offsets from the ADC Base Peripheral Address.
 * @{
 */
#define MXC_R_ADC_CTRL0                    ((uint32_t)0x00000000UL) /**< Offset from ADC Base Address: <tt> 0x0000</tt> */
#define MXC_R_ADC_CTRL1                    ((uint32_t)0x00000004UL) /**< Offset from ADC Base Address: <tt> 0x0004</tt> */
#define MXC_R_ADC_CLKCTRL                  ((uint32_t)0x00000008UL) /**< Offset from ADC Base Address: <tt> 0x0008</tt> */
#define MXC_R_ADC_SAMPCLKCTRL              ((uint32_t)0x0000000CUL) /**< Offset from ADC Base Address: <tt> 0x000C</tt> */
#define MXC_R_ADC_CHSEL0                   ((uint32_t)0x00000010UL) /**< Offset from ADC Base Address: <tt> 0x0010</tt> */
#define MXC_R_ADC_CHSEL1                   ((uint32_t)0x00000014UL) /**< Offset from ADC Base Address: <tt> 0x0014</tt> */
#define MXC_R_ADC_CHSEL2                   ((uint32_t)0x00000018UL) /**< Offset from ADC Base Address: <tt> 0x0018</tt> */
#define MXC_R_ADC_CHSEL3                   ((uint32_t)0x0000001CUL) /**< Offset from ADC Base Address: <tt> 0x001C</tt> */
#define MXC_R_ADC_RESTART                  ((uint32_t)0x00000030UL) /**< Offset from ADC Base Address: <tt> 0x0030</tt> */
#define MXC_R_ADC_DATAFMT                  ((uint32_t)0x0000003CUL) /**< Offset from ADC Base Address: <tt> 0x003C</tt> */
#define MXC_R_ADC_FIFODMACTRL              ((uint32_t)0x00000040UL) /**< Offset from ADC Base Address: <tt> 0x0040</tt> */
#define MXC_R_ADC_DATA                     ((uint32_t)0x00000044UL) /**< Offset from ADC Base Address: <tt> 0x0044</tt> */
#define MXC_R_ADC_STATUS                   ((uint32_t)0x00000048UL) /**< Offset from ADC Base Address: <tt> 0x0048</tt> */
#define MXC_R_ADC_CHSTATUS                 ((uint32_t)0x0000004CUL) /**< Offset from ADC Base Address: <tt> 0x004C</tt> */
#define MXC_R_ADC_INTEN                    ((uint32_t)0x00000050UL) /**< Offset from ADC Base Address: <tt> 0x0050</tt> */
#define MXC_R_ADC_INTFL                    ((uint32_t)0x00000054UL) /**< Offset from ADC Base Address: <tt> 0x0054</tt> */
#define MXC_R_ADC_SFRADDROFFSET            ((uint32_t)0x00000060UL) /**< Offset from ADC Base Address: <tt> 0x0060</tt> */
#define MXC_R_ADC_SFRADDR                  ((uint32_t)0x00000064UL) /**< Offset from ADC Base Address: <tt> 0x0064</tt> */
#define MXC_R_ADC_SFRWRDATA                ((uint32_t)0x00000068UL) /**< Offset from ADC Base Address: <tt> 0x0068</tt> */
#define MXC_R_ADC_SFRRDDATA                ((uint32_t)0x0000006CUL) /**< Offset from ADC Base Address: <tt> 0x006C</tt> */
#define MXC_R_ADC_SFRSTATUS                ((uint32_t)0x00000070UL) /**< Offset from ADC Base Address: <tt> 0x0070</tt> */
/**@} end of group adc_registers */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_CTRL0 ADC_CTRL0
 * @brief    Control Register 0.
 * @{
 */
#define MXC_F_ADC_CTRL0_ADC_EN_POS                     0 /**< CTRL0_ADC_EN Position */
#define MXC_F_ADC_CTRL0_ADC_EN                         ((uint32_t)(0x1UL << MXC_F_ADC_CTRL0_ADC_EN_POS)) /**< CTRL0_ADC_EN Mask */

#define MXC_F_ADC_CTRL0_BIAS_EN_POS                    1 /**< CTRL0_BIAS_EN Position */
#define MXC_F_ADC_CTRL0_BIAS_EN                        ((uint32_t)(0x1UL << MXC_F_ADC_CTRL0_BIAS_EN_POS)) /**< CTRL0_BIAS_EN Mask */

#define MXC_F_ADC_CTRL0_SKIP_CAL_POS                   2 /**< CTRL0_SKIP_CAL Position */
#define MXC_F_ADC_CTRL0_SKIP_CAL                       ((uint32_t)(0x1UL << MXC_F_ADC_CTRL0_SKIP_CAL_POS)) /**< CTRL0_SKIP_CAL Mask */

#define MXC_F_ADC_CTRL0_CHOP_FORCE_POS                 3 /**< CTRL0_CHOP_FORCE Position */
#define MXC_F_ADC_CTRL0_CHOP_FORCE                     ((uint32_t)(0x1UL << MXC_F_ADC_CTRL0_CHOP_FORCE_POS)) /**< CTRL0_CHOP_FORCE Mask */

#define MXC_F_ADC_CTRL0_RESETB_POS                     4 /**< CTRL0_RESETB Position */
#define MXC_F_ADC_CTRL0_RESETB                         ((uint32_t)(0x1UL << MXC_F_ADC_CTRL0_RESETB_POS)) /**< CTRL0_RESETB Mask */

/**@} end of group ADC_CTRL0_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_CTRL1 ADC_CTRL1
 * @brief    Control Register 1.
 * @{
 */
#define MXC_F_ADC_CTRL1_START_POS                      0 /**< CTRL1_START Position */
#define MXC_F_ADC_CTRL1_START                          ((uint32_t)(0x1UL << MXC_F_ADC_CTRL1_START_POS)) /**< CTRL1_START Mask */

#define MXC_F_ADC_CTRL1_TRIG_MODE_POS                  1 /**< CTRL1_TRIG_MODE Position */
#define MXC_F_ADC_CTRL1_TRIG_MODE                      ((uint32_t)(0x1UL << MXC_F_ADC_CTRL1_TRIG_MODE_POS)) /**< CTRL1_TRIG_MODE Mask */

#define MXC_F_ADC_CTRL1_CNV_MODE_POS                   2 /**< CTRL1_CNV_MODE Position */
#define MXC_F_ADC_CTRL1_CNV_MODE                       ((uint32_t)(0x1UL << MXC_F_ADC_CTRL1_CNV_MODE_POS)) /**< CTRL1_CNV_MODE Mask */

#define MXC_F_ADC_CTRL1_SAMP_CK_OFF_POS                3 /**< CTRL1_SAMP_CK_OFF Position */
#define MXC_F_ADC_CTRL1_SAMP_CK_OFF                    ((uint32_t)(0x1UL << MXC_F_ADC_CTRL1_SAMP_CK_OFF_POS)) /**< CTRL1_SAMP_CK_OFF Mask */

#define MXC_F_ADC_CTRL1_TRIG_SEL_POS                   4 /**< CTRL1_TRIG_SEL Position */
#define MXC_F_ADC_CTRL1_TRIG_SEL                       ((uint32_t)(0x7UL << MXC_F_ADC_CTRL1_TRIG_SEL_POS)) /**< CTRL1_TRIG_SEL Mask */

