analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32672/Include/adc_regs.h
#define MXC_F_ADC_FIFODMACTRL_THRESH_POS               8 /**< FIFODMACTRL_THRESH Position */
#define MXC_F_ADC_FIFODMACTRL_THRESH                   ((uint32_t)(0xFFUL << MXC_F_ADC_FIFODMACTRL_THRESH_POS)) /**< FIFODMACTRL_THRESH Mask */

/**@} end of group ADC_FIFODMACTRL_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_DATA ADC_DATA
 * @brief    Data Register (FIFO).
 * @{
 */
#define MXC_F_ADC_DATA_DATA_POS                        0 /**< DATA_DATA Position */
#define MXC_F_ADC_DATA_DATA                            ((uint32_t)(0xFFFFUL << MXC_F_ADC_DATA_DATA_POS)) /**< DATA_DATA Mask */

#define MXC_F_ADC_DATA_CHAN_POS                        16 /**< DATA_CHAN Position */
#define MXC_F_ADC_DATA_CHAN                            ((uint32_t)(0x1FUL << MXC_F_ADC_DATA_CHAN_POS)) /**< DATA_CHAN Mask */

#define MXC_F_ADC_DATA_INVALID_POS                     24 /**< DATA_INVALID Position */
#define MXC_F_ADC_DATA_INVALID                         ((uint32_t)(0x1UL << MXC_F_ADC_DATA_INVALID_POS)) /**< DATA_INVALID Mask */

#define MXC_F_ADC_DATA_CLIPPED_POS                     31 /**< DATA_CLIPPED Position */
#define MXC_F_ADC_DATA_CLIPPED                         ((uint32_t)(0x1UL << MXC_F_ADC_DATA_CLIPPED_POS)) /**< DATA_CLIPPED Mask */

/**@} end of group ADC_DATA_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_STATUS ADC_STATUS
 * @brief    Status Register
 * @{
 */
#define MXC_F_ADC_STATUS_READY_POS                     0 /**< STATUS_READY Position */
#define MXC_F_ADC_STATUS_READY                         ((uint32_t)(0x1UL << MXC_F_ADC_STATUS_READY_POS)) /**< STATUS_READY Mask */

#define MXC_F_ADC_STATUS_EMPTY_POS                     1 /**< STATUS_EMPTY Position */
#define MXC_F_ADC_STATUS_EMPTY                         ((uint32_t)(0x1UL << MXC_F_ADC_STATUS_EMPTY_POS)) /**< STATUS_EMPTY Mask */

#define MXC_F_ADC_STATUS_FULL_POS                      2 /**< STATUS_FULL Position */
#define MXC_F_ADC_STATUS_FULL                          ((uint32_t)(0x1UL << MXC_F_ADC_STATUS_FULL_POS)) /**< STATUS_FULL Mask */

#define MXC_F_ADC_STATUS_FIFO_LEVEL_POS                8 /**< STATUS_FIFO_LEVEL Position */
#define MXC_F_ADC_STATUS_FIFO_LEVEL                    ((uint32_t)(0xFFUL << MXC_F_ADC_STATUS_FIFO_LEVEL_POS)) /**< STATUS_FIFO_LEVEL Mask */

/**@} end of group ADC_STATUS_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_CHSTATUS ADC_CHSTATUS
 * @brief    Channel Status
 * @{
 */
#define MXC_F_ADC_CHSTATUS_CLIPPED_POS                 0 /**< CHSTATUS_CLIPPED Position */
#define MXC_F_ADC_CHSTATUS_CLIPPED                     ((uint32_t)(0xFFFFFFFFUL << MXC_F_ADC_CHSTATUS_CLIPPED_POS)) /**< CHSTATUS_CLIPPED Mask */

/**@} end of group ADC_CHSTATUS_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_INTEN ADC_INTEN
 * @brief    Interrupt Enable Register.
 * @{
 */
#define MXC_F_ADC_INTEN_READY_POS                      0 /**< INTEN_READY Position */
#define MXC_F_ADC_INTEN_READY                          ((uint32_t)(0x1UL << MXC_F_ADC_INTEN_READY_POS)) /**< INTEN_READY Mask */

#define MXC_F_ADC_INTEN_ABORT_POS                      2 /**< INTEN_ABORT Position */
#define MXC_F_ADC_INTEN_ABORT                          ((uint32_t)(0x1UL << MXC_F_ADC_INTEN_ABORT_POS)) /**< INTEN_ABORT Mask */

#define MXC_F_ADC_INTEN_START_DET_POS                  3 /**< INTEN_START_DET Position */
#define MXC_F_ADC_INTEN_START_DET                      ((uint32_t)(0x1UL << MXC_F_ADC_INTEN_START_DET_POS)) /**< INTEN_START_DET Mask */

#define MXC_F_ADC_INTEN_SEQ_STARTED_POS                4 /**< INTEN_SEQ_STARTED Position */
#define MXC_F_ADC_INTEN_SEQ_STARTED                    ((uint32_t)(0x1UL << MXC_F_ADC_INTEN_SEQ_STARTED_POS)) /**< INTEN_SEQ_STARTED Mask */

#define MXC_F_ADC_INTEN_SEQ_DONE_POS                   5 /**< INTEN_SEQ_DONE Position */
#define MXC_F_ADC_INTEN_SEQ_DONE                       ((uint32_t)(0x1UL << MXC_F_ADC_INTEN_SEQ_DONE_POS)) /**< INTEN_SEQ_DONE Mask */

#define MXC_F_ADC_INTEN_CONV_DONE_POS                  6 /**< INTEN_CONV_DONE Position */
#define MXC_F_ADC_INTEN_CONV_DONE                      ((uint32_t)(0x1UL << MXC_F_ADC_INTEN_CONV_DONE_POS)) /**< INTEN_CONV_DONE Mask */

#define MXC_F_ADC_INTEN_CLIPPED_POS                    7 /**< INTEN_CLIPPED Position */
#define MXC_F_ADC_INTEN_CLIPPED                        ((uint32_t)(0x1UL << MXC_F_ADC_INTEN_CLIPPED_POS)) /**< INTEN_CLIPPED Mask */

#define MXC_F_ADC_INTEN_FIFO_LVL_POS                   8 /**< INTEN_FIFO_LVL Position */
#define MXC_F_ADC_INTEN_FIFO_LVL                       ((uint32_t)(0x1UL << MXC_F_ADC_INTEN_FIFO_LVL_POS)) /**< INTEN_FIFO_LVL Mask */

#define MXC_F_ADC_INTEN_FIFO_UFL_POS                   9 /**< INTEN_FIFO_UFL Position */
#define MXC_F_ADC_INTEN_FIFO_UFL                       ((uint32_t)(0x1UL << MXC_F_ADC_INTEN_FIFO_UFL_POS)) /**< INTEN_FIFO_UFL Mask */

#define MXC_F_ADC_INTEN_FIFO_OFL_POS                   10 /**< INTEN_FIFO_OFL Position */
#define MXC_F_ADC_INTEN_FIFO_OFL                       ((uint32_t)(0x1UL << MXC_F_ADC_INTEN_FIFO_OFL_POS)) /**< INTEN_FIFO_OFL Mask */

/**@} end of group ADC_INTEN_Register */

/**
 * @ingroup  adc_registers
 * @defgroup ADC_INTFL ADC_INTFL
 * @brief    Interrupt Flags Register.
 * @{
 */
#define MXC_F_ADC_INTFL_READY_POS                      0 /**< INTFL_READY Position */
#define MXC_F_ADC_INTFL_READY                          ((uint32_t)(0x1UL << MXC_F_ADC_INTFL_READY_POS)) /**< INTFL_READY Mask */

#define MXC_F_ADC_INTFL_ABORT_POS                      2 /**< INTFL_ABORT Position */
#define MXC_F_ADC_INTFL_ABORT                          ((uint32_t)(0x1UL << MXC_F_ADC_INTFL_ABORT_POS)) /**< INTFL_ABORT Mask */

#define MXC_F_ADC_INTFL_START_DET_POS                  3 /**< INTFL_START_DET Position */
#define MXC_F_ADC_INTFL_START_DET                      ((uint32_t)(0x1UL << MXC_F_ADC_INTFL_START_DET_POS)) /**< INTFL_START_DET Mask */

#define MXC_F_ADC_INTFL_SEQ_STARTED_POS                4 /**< INTFL_SEQ_STARTED Position */
#define MXC_F_ADC_INTFL_SEQ_STARTED                    ((uint32_t)(0x1UL << MXC_F_ADC_INTFL_SEQ_STARTED_POS)) /**< INTFL_SEQ_STARTED Mask */

#define MXC_F_ADC_INTFL_SEQ_DONE_POS                   5 /**< INTFL_SEQ_DONE Position */
#define MXC_F_ADC_INTFL_SEQ_DONE                       ((uint32_t)(0x1UL << MXC_F_ADC_INTFL_SEQ_DONE_POS)) /**< INTFL_SEQ_DONE Mask */

